In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

np.random.seed(101)

df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
print(df)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [3]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [6]:
df["new"] = df["W"]+df["Z"]

In [7]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [8]:
df.loc['E']

W      0.190794
X      1.978757
Y      2.605967
Z      0.683509
new    0.874303
Name: E, dtype: float64

In [9]:
df.iloc[4]

W      0.190794
X      1.978757
Y      2.605967
Z      0.683509
new    0.874303
Name: E, dtype: float64

In [12]:
df.drop("new", axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [15]:
df.drop("E")

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752

In [17]:
df.drop("new",1,inplace=True)

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df.loc[['B','D'],['X','Y']]

          X         Y
B -0.319318 -0.848077
D -0.758872 -0.933237

In [21]:
df.iloc[1:3,1:3]

          X         Y
B -0.319318 -0.848077
C  0.740122  0.528813

In [22]:
df.iloc[[1,2],[1,2]]

          X         Y
B -0.319318 -0.848077
C  0.740122  0.528813

In [23]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df[df["W"]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df[df["Z"] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [29]:
df[df["W"]>0]["Y"]

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [30]:
# rest_index

df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [32]:
df["States"] = "CA NY NJ SA WD".split()

In [33]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     NJ
D  0.188695 -0.758872 -0.933237  0.955057     SA
E  0.190794  1.978757  2.605967  0.683509     WD

In [34]:
df.set_index("States")

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
NJ     -2.018168  0.740122  0.528813 -0.589001
SA      0.188695 -0.758872 -0.933237  0.955057
WD      0.190794  1.978757  2.605967  0.683509

In [35]:
outer = ["G1","G1","G1","G2","G2","G2"]
inner = [1,2,3,1,2,3]
multi_index = list(zip(outer,inner))
multi_index = pd.MultiIndex.from_tuples(multi_index)

In [36]:
multi_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [38]:
new_df = pd.DataFrame(randn(6,2), multi_index)

In [39]:
new_df

             0         1
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [40]:
new_df.loc["G1"]

          0         1
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [47]:
new_df.loc["G1"].loc[2]

0   -0.943406
1    0.484752
Name: 2, dtype: float64

In [46]:
new_df.loc["G1",1]

0   -0.497104
1   -0.754070
Name: (G1, 1), dtype: float64

In [48]:
new_df.index.names = ["Group","num"]

In [49]:
new_df

                  0         1
Group num
G1    1   -0.497104 -0.754070
      2   -0.943406  0.484752
      3   -0.116773  1.901755
G2    1    0.238127  1.996652
      2   -0.993263  0.196800
      3   -1.136645  0.000366

In [50]:
new_df.loc["G1"].loc[1][1]

-0.7540697010400628

In [51]:
new_df.loc["G1"].loc[1,1]

-0.7540697010400628

In [52]:
new_df.loc["G1"].iloc[1,1]

0.48475164718163294

In [56]:
new_df.xs("G1",level=0)

            0         1
num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [58]:
new_df.xs(1,level=1)

              0         1
Group
G1    -0.497104 -0.754070
G2     0.238127  1.996652